app/Controllers/ProcessController.php

SELECT *
FROM `note`
WHERE `username` = 'hakankumas'
AND `ishide` = 1
ORDER BY `note_updateDate` DESC, `note_registerDate` DESC
---
    public function page_home() {
        $session = session();
        $getSession_username = $session->get("username");
        $getSession_password = $session->get("password");

        $notes = $this->NoteModel->where("username" , $getSession_username)->where("ishide" , 1)->orderBy("note_updateDate" , "DESC")->orderBy("note_registerDate" , "DESC")->find();